import * as Api from './ApiInterface'

const ErrorCode = {

	// GET_USER_HEAD_IMG: 获取用户头像
	[Api.GET_USER_HEAD_IMG]: {
		1001000: '成功',
		1001012: '系统没有该用户信息',
	},

	// LOGIN_BIND_CHECK: 检查用户登录状态
	[Api.LOGIN_BIND_CHECK]: {
		1001006: '已绑定',
		1001007: '未绑定',
		1001012: '系统没有该用户信息',
	},

	// LOGIN_BIND_STUDENT: 绑定用户接口
	[Api.LOGIN_BIND_STUDENT]: {
		1001004: '成功',
		1001002: 'OPENID为空',
		1001003: 'TOKEN为空',
		1001008: '该用户已被绑定过',
		1001009: 'MYSISE没有该用户存在',
		1001010: '学号或者密码错误',
		// 1001011: '账号不能正常使用',
		1001011: '你已被列入黑名单',
		1001012: '系统没有该用户信息',
	},

	// UNBIND_USER: 解绑
	[Api.UNBIND_USER]: {
		1001005: '成功',
		1001001: '用户模块请求失败',
		1001012: '系统没有该用户信息',
	},

	// GET_CANTEEN_LIST: 查询营业中的食堂列表
	[Api.GET_CANTEEN_LIST]: {
		2001000: '成功',
	},

	// CHECK_PRODUCT_STATE: 在提交订单时对库存和商品状态进行检测
	[Api.CHECK_PRODUCT_STATE]: {
		9001508: '商品已经下架, 请重新选择',
		9001509: '不好意思,商品已售罄,请重新选择',
		9001510: '购物车中有商品不可购买，请重新选择',
		5001013: '商品中有规格库存不足，请重新选择'
	},

	// CHECK_PAY_STATE: 检验用户是否存在待支付订单      文档待修改！！！！！！！！！！！！！！！！！！！！
	[Api.CHECK_PAY_STATE]: {
		0      : '获取成功',
		9001103: '用户学号或工号不合法',
	},

	// ORDER_ADD: 订单提交
	[Api.ORDER_ADD]: {
		9001000: "订单创建成功",
		9001005: "分配保温箱为空",
		9001101: "下单参数有误",
		9001102: "购物车为空",
		9001202: "该地址保温箱数量不足，请重新选择地址",
		9001204: "该地址保温箱数量不足，请重新选择地址",
		9001205: "该地址暂无可用保温箱，请重新选择地址",
		9001304: "规格库存不足",
		9001401: "用户收货地址不存在",
		9001507: "该区域没有可用保温柜",
		9001508: "购物车中有商品已经下架,请重新选择商品",
		9001509: "购物车中有商品已售罄,请重新选择商品",
		9001510: "购物车中有商品不可购买,请重新选择商品",
		9001511: "本时间段不允许下单",
		9001513: "该区域没有投放保温箱",
		9001514: "该区域被禁用",
		1001027: "您是黑名单，无法下单"
	},

	// CHANGE_PASSWORD: 修改密码
	[Api.CHANGE_PASSWORD]: {
		1001000: '修改成功',
		1001003: '登陆超时',
		1001012: '系统没有该用户信息',
		1001019: '原密码错误'
	},

	// ORDER_COMMENT_ADD: 评价订单
	[Api.ORDER_COMMENT_ADD]: {
		9001403: '订单评价成功',
		9001404: '订单评价失败',
		9001103: '用户学号或工号不合法'
	},

	// ORDER_COMMENT_FINDONEBYID: 获取订单评价信息
	[Api.ORDER_COMMENT_FINDONEBYID]: {
		9001405: '获取订单评价成功',
		9001406: '获取订单评价失败',
		9001103: '用户学号或工号不合法'
	},

	// OPEN_UNLOCK: 远程开锁
	[Api.OPEN_UNLOCK]: {
		1401000: '开锁成功',
		1401002: '请求无效',
		1401003: '开锁码无效',
		1401004: '当前订单状态不允许开锁',
		1401005: '子订单状态修改失败,开锁失败',
		1401006: '硬件服务器出现故障',
	},

	// ADD_ADDRESS: 添加收货地址
	[Api.ADD_ADDRESS]: {
		1001000: '添加成功',
		1001001: '添加失败',
	},

	// GET_USEABLE_ADDRESS_LIST: （用户地址）获取可用区域信息
	[Api.GET_USEABLE_ADDRESS_LIST]: {
		1001000: '请求成功',
		1001013: '没有可用区域',
	},

	// CLOSE_ORDER: 下单后支付前的取消订单
	[Api.CLOSE_ORDER]: {
		9001601: '取消订单成功',
		9001602: '取消订单失败',
		9001701: '用户无此订单',
	},

	// GET_PAYMENT_INFO: 获取支付信息
	[Api.GET_PAYMENT_INFO]: {
		9001002: '订单不存在',
		9001402: '订单状态不正确',
	},

	// GET_RECPVERY_CODE: 找回二维码
	[Api.GET_RECPVERY_CODE]: {
		900001: '订单不存在',
	},
}

export const GetReturnCode = (type, code) => {
	if(ErrorCode[type][code]) {
		return ErrorCode[type][code]
	} else {
		return '服务器繁忙'
	}
}